// Урок на отработку взаимодействия с API (developer.marvel.com - требует регистрацию, выдает пароль доступа, необходимый для запросов)

// Верстку скачал готовую, npm i - установка зависимостей с package.json

// npm start - запуск

// npm i prop-types --save  (для проверки типов пропсов - наподобие TypeScript, примеры в CharInfo или CharList)

// Изначально проект создан на классах и компонентах жизненного цикла, переделываем на реакт-компоненты и хуки

// Хуки - функции, упрощенный вариант компонентов ЖЦ, при использовании соблюдаем правил - используем в реакт-компонентах и только на верхнем уровне - не вкладываем в условия или циклы и т.п

// npm i react@latest react-dom@latest --save  - обновляем до последних версий(в 18-й версии встроен автоматический batching - рендеры, близкие по времени, обьединяются в один для уменьшения нагрузки на систему(можно разьединить с помощью встроенного метода flushSync - например, если нужно встроить дополнительный функционал между рендеров))

// npm i react-router-dom@5.3.0 --save (для примера работы с маршрутами в 5-й версии)
// npm i react-router-dom@6.26.1 --save

// npm i --save formik - для работы с формами
// npm i --save yup - дополнительный к формику для валидации форм

// npm install --save react-helmet - для заголовков страниц

