// Урок на отработку взаимодействия с API (developer.marvel.com - требует регистрацию, выдает пароль доступа, необходимый для запросов)

// Верстку скачал готовую, npm i - установка зависимостей с package.json

// npm start - запуск

// npm i prop-types --save  (для проверки типов пропсов - наподобие TypeScript, примеры в CharInfo или CharList)

// Изначально проект создан на классах и компонентах жизненного цикла, переделываем на реакт-компоненты и хуки

// Хуки - функции, упрощенный вариант компонентов ЖЦ, при использовании соблюдаем правил - используем в реакт-компонентах и только на верхнем уровне - не вкладываем в условия или циклы и т.п